isc-fs/stm32-can-bootloader/tests/unit/test_bl_proto_dispatch.c
    /* === 36 full CFs: DLC=8, 7 data bytes each.
     *
     * Sequence pattern from the trace:
     *   CFs 1..15  → seq 1..15
     *   CFs 16..31 → seq 0..15
     *   CFs 32..36 → seq 0..4
     * All DLC=8. */
    for (uint8_t i = 0U; i < 36U; i++) {
        uint8_t seq = (uint8_t)((i + 1U) & 0x0FU);
        uint8_t cf[8];
        cf[0] = (uint8_t)(0x20U | seq);
        for (uint8_t j = 1U; j < 8U; j++) {
            cf[j] = (uint8_t)(0xA0U + (i & 0x3FU));
        }
        bl_proto_dispatch(&id, cf, 8U);
    }

    /* === 37th CF: PCI 0x25 (seq=5, the next after CF36's seq=4),
     *   DLC=8 with last 3 bytes zero-padded (real data ends at index 4).
     * Total real data after FF = 36*7 + 4 = 252 + 4 = 256 bytes.
     * Total message = 6 + 256 = 262 = declared. === */
    uint8_t cf37[8];
    cf37[0] = 0x25U;
    cf37[1] = 0xF1U; cf37[2] = 0x10U; cf37[3] = 0x02U; cf37[4] = 0x08U;
    cf37[5] = 0x00U; cf37[6] = 0x00U; cf37[7] = 0x00U;  /* padding */
    bl_proto_dispatch(&id, cf37, 8U);

    /* Assert: no captured frame is a NACK with TRANSPORT_ERROR. */
    int n = mock_fdcan_tx_count();
    for (int i = 0; i < n; i++) {
        const mock_fdcan_frame_t *f = mock_fdcan_get(i);
        TEST_ASSERT_NOT_NULL(f);
        if (frame_is_nack_with_code(f, (uint8_t)BL_NACK_TRANSPORT_ERROR)) {
            char detail[256];
            (void)snprintf(detail, sizeof(detail),
                "BL emitted NACK(TRANSPORT_ERROR) at TX frame %d/%d "
                "(rejected_opcode=0x%02X). Issue #94 regression: the "
                "262-byte / 37-CF WRITE_CHUNK shape from the operator's "
                "bench trace fails reassembly in unit test.",
                i, n, f->data[2]);
            TEST_FAIL_MESSAGE(detail);
        }
    }
}


/* ---- Sanity: valid SF still passes through the gate ---- */

void test_dispatch_valid_sf_pci_passes_pci_gate(void)
{
    /* Negative control: a frame whose PCI nibble IS a valid SF must
     * not trip the bad-PCI gate. We don't fully validate downstream
     * dispatch here (that's bigger tests in a follow-up PR); we just
     * confirm the bad-PCI NACK doesn't fire for a well-formed PCI.
     *
     * The reassembled SF will carry msg_type=0 / opcode=0 which the
     * handler tree treats as BL_CMD unknown opcode → NACK(UNSUPPORTED).
     * That's fine for this test: we just want to assert the emitted
     * NACK is NOT the TRANSPORT_ERROR one. */
    bl_proto_id_t id = host_to_us();
    /* SF PCI 0x01, then msg_type=0 + opcode=0. Length 2 bytes after PCI. */
    uint8_t frame[8] = { (uint8_t)(BL_ISOTP_PCI_SF | 0x02U),
                         0x00, 0x00, 0, 0, 0, 0, 0 };

    bl_proto_dispatch(&id, frame, 8);

    /* The handler emitted SOMETHING (likely a NACK(UNSUPPORTED) for
     * the zero opcode), but importantly not the TRANSPORT_ERROR NACK
     * that the bad-PCI gate would emit. */
    TEST_ASSERT_GREATER_OR_EQUAL_INT(1, mock_fdcan_tx_count());
    const mock_fdcan_frame_t *tx = mock_fdcan_get(0);
    TEST_ASSERT_NOT_NULL(tx);
    /* If this is a NACK, byte 3 holds the code; assert it's not
     * TRANSPORT_ERROR. (For an ACK or any other reply, the assertion
     * is still meaningful — it just trivially passes.) */
    TEST_ASSERT_NOT_EQUAL((uint8_t)BL_NACK_TRANSPORT_ERROR, tx->data[3]);
}


/* ============================================================
 * Opcode-handler coverage. The gate tests above pin frame-level
 * filtering. This block covers what happens AFTER the gates —
 * each test sends a single-frame command and asserts the
 * dispatcher landed on the right `handle_*` function with the
 * right session / arg / error semantics.
 *
 * Cross-test contamination risk: `g_session_active` is a static
 * inside `bl_proto.c` and persists across tests. We can't read
 * or clear it directly, so every test that cares starts with an
 * explicit DISCONNECT (which always clears the latch and ACKs
 * once) plus `mock_fdcan_reset()` to start with an empty TX
 * ring. The convention is intentionally noisy at the top of
 * each test rather than hidden in a tearDown — easier to reason
 * about what state each test is in just from reading it.
 * ============================================================ */

/* Build an SF frame for a `BL_MSG_CMD` with the given opcode and
 * args, and feed it through the dispatcher. The SF payload-length
 * nibble is `2 + args_len` (msg_type + opcode + args). */
static void send_cmd_sf(uint8_t opcode, const uint8_t *args, uint8_t args_len)
{
    bl_proto_id_t id = host_to_us();
    uint8_t frame[8] = { 0 };
    uint8_t payload_len = (uint8_t)(2U + args_len);
    /* SF can carry at most 7 payload bytes — enforced upstream by
     * the caller, but be defensive so a typo doesn't silently send
     * a truncated request. */
    TEST_ASSERT_LESS_OR_EQUAL_UINT8(7U, payload_len);
    frame[0] = (uint8_t)(BL_ISOTP_PCI_SF | (payload_len & 0x07U));
    frame[1] = (uint8_t)BL_MSG_CMD;
    frame[2] = opcode;
    for (uint8_t i = 0U; i < args_len; i++) {
        frame[3U + i] = args[i];
    }
    bl_proto_dispatch(&id, frame, 8U);
}

/* Reset session latch + clear TX ring. Safe to call when there's
 * no active session (DISCONNECT is idempotent). After this returns
 * the BL is in {session=false, ring=empty}. */
static void reset_session_and_tx(void)
{
    send_cmd_sf((uint8_t)BL_CMD_DISCONNECT, NULL, 0U);
    mock_fdcan_reset();
}

/* Prime an active session with a valid CONNECT, then clear the TX
 * ring so the test's first assertion sees only its own response.
 * Caller must verify the session actually took effect by some
 * downstream observation. */
static void prime_session(void)
{
    reset_session_and_tx();
    uint8_t args[2] = {
        (uint8_t)BL_PROTO_VERSION_MAJOR,
        (uint8_t)BL_PROTO_VERSION_MINOR,
    };
    send_cmd_sf((uint8_t)BL_CMD_CONNECT, args, 2U);
    /* Sanity: the CONNECT ACK should have landed on the wire. */
    TEST_ASSERT_GREATER_OR_EQUAL_INT(1, mock_fdcan_tx_count());
    mock_fdcan_reset();
}

/* ---- CONNECT ---- */

void test_handle_connect_valid_version_acks_and_latches_session(void)
{
    reset_session_and_tx();

    uint8_t args[2] = {
        (uint8_t)BL_PROTO_VERSION_MAJOR,
        (uint8_t)BL_PROTO_VERSION_MINOR,
    };
    send_cmd_sf((uint8_t)BL_CMD_CONNECT, args, 2U);

    /* One TX: ACK with [BL_CMD_CONNECT, MAJOR, MINOR] payload. */
    TEST_ASSERT_EQUAL_INT(1, mock_fdcan_tx_count());
    const mock_fdcan_frame_t *tx = mock_fdcan_get(0);
    TEST_ASSERT_NOT_NULL(tx);
    TEST_ASSERT_EQUAL_UINT8((uint8_t)(BL_ISOTP_PCI_SF | 0x04U), tx->data[0]);
    TEST_ASSERT_EQUAL_UINT8((uint8_t)BL_MSG_ACK,           tx->data[1]);
    TEST_ASSERT_EQUAL_UINT8((uint8_t)BL_CMD_CONNECT,       tx->data[2]);
    TEST_ASSERT_EQUAL_UINT8((uint8_t)BL_PROTO_VERSION_MAJOR, tx->data[3]);
    TEST_ASSERT_EQUAL_UINT8((uint8_t)BL_PROTO_VERSION_MINOR, tx->data[4]);

    /* Latch verification: a session-gated op should now respond with
     * something OTHER than BAD_SESSION. NVM_READ is the cleanest
     * probe because its 2-byte arg fits in a single SF and, with
     * NVM empty, the post-session reply is NACK(NVM_NOT_FOUND) — a
     * distinct code that can't be confused with the BAD_SESSION
     * we're guarding against. */
    mock_fdcan_reset();
    uint8_t probe_key[2] = { 0xCDU, 0xABU };  /* arbitrary unused key */
    send_cmd_sf((uint8_t)BL_CMD_NVM_READ, probe_key, 2U);
    TEST_ASSERT_EQUAL_INT(1, mock_fdcan_tx_count());
    const mock_fdcan_frame_t *reply = mock_fdcan_get(0);
    TEST_ASSERT_NOT_NULL(reply);
    TEST_ASSERT_EQUAL_UINT8((uint8_t)BL_MSG_NACK, reply->data[1]);
    /* Distinguishes "session live, key missing" from "session not
     * active" — exactly the latch state we just asserted. */
    TEST_ASSERT_EQUAL_UINT8((uint8_t)BL_NACK_NVM_NOT_FOUND, reply->data[3]);
}

