isc-fs/stm32-can-bootloader/tests/unit/test_bl_proto_dispatch.c
void test_handle_connect_wrong_major_nacks_protocol_version(void)
{
    reset_session_and_tx();

    /* Send major = MAJOR + 1 so it can't ever match the BL's
     * compile-time MAJOR regardless of what we bump that to. */
    uint8_t args[2] = {
        (uint8_t)(BL_PROTO_VERSION_MAJOR + 1U),
        (uint8_t)BL_PROTO_VERSION_MINOR,
    };
    send_cmd_sf((uint8_t)BL_CMD_CONNECT, args, 2U);

    TEST_ASSERT_EQUAL_INT(1, mock_fdcan_tx_count());
    const mock_fdcan_frame_t *tx = mock_fdcan_get(0);
    TEST_ASSERT_NOT_NULL(tx);
    TEST_ASSERT_EQUAL_UINT8((uint8_t)BL_MSG_NACK, tx->data[1]);
    TEST_ASSERT_EQUAL_UINT8((uint8_t)BL_CMD_CONNECT, tx->data[2]);
    TEST_ASSERT_EQUAL_UINT8((uint8_t)BL_NACK_PROTOCOL_VERSION, tx->data[3]);

    /* And the session latch must NOT have gone high — a follow-up
     * session-gated op should still NACK with BAD_SESSION. */
    mock_fdcan_reset();
    send_cmd_sf((uint8_t)BL_CMD_NVM_READ,
                (const uint8_t[]){ 0x01U, 0x00U }, 2U);
    TEST_ASSERT_EQUAL_INT(1, mock_fdcan_tx_count());
    const mock_fdcan_frame_t *reply = mock_fdcan_get(0);
    TEST_ASSERT_NOT_NULL(reply);
    TEST_ASSERT_EQUAL_UINT8((uint8_t)BL_MSG_NACK, reply->data[1]);
    TEST_ASSERT_EQUAL_UINT8((uint8_t)BL_NACK_BAD_SESSION, reply->data[3]);
}

void test_handle_connect_short_args_nacks_unsupported(void)
{
    /* CONNECT requires 2 args (major + minor). A 1-arg payload must
     * be rejected — the handler's `args_len < 2` guard. */
    reset_session_and_tx();

    uint8_t args[1] = { (uint8_t)BL_PROTO_VERSION_MAJOR };
    send_cmd_sf((uint8_t)BL_CMD_CONNECT, args, 1U);

    TEST_ASSERT_EQUAL_INT(1, mock_fdcan_tx_count());
    const mock_fdcan_frame_t *tx = mock_fdcan_get(0);
    TEST_ASSERT_NOT_NULL(tx);
    TEST_ASSERT_EQUAL_UINT8((uint8_t)BL_MSG_NACK, tx->data[1]);
    TEST_ASSERT_EQUAL_UINT8((uint8_t)BL_CMD_CONNECT, tx->data[2]);
    TEST_ASSERT_EQUAL_UINT8((uint8_t)BL_NACK_UNSUPPORTED, tx->data[3]);
}

/* ---- DISCONNECT ---- */

void test_handle_disconnect_clears_session_latch(void)
{
    /* CONNECT, verify latch is high (FLASH_ERASE doesn't NACK with
     * BAD_SESSION), DISCONNECT, verify latch is low (FLASH_ERASE
     * now NACKs with BAD_SESSION). The before/after symmetry is the
     * test point. */
    prime_session();

    /* NVM_READ used as the latch probe (same rationale as the
     * connect-latch test above — SF-fitting args, distinct NACK
     * code when session is live but key is missing). */
    uint8_t probe_key[2] = { 0xCDU, 0xABU };
    send_cmd_sf((uint8_t)BL_CMD_NVM_READ, probe_key, 2U);
    TEST_ASSERT_EQUAL_INT(1, mock_fdcan_tx_count());
    {
        const mock_fdcan_frame_t *r = mock_fdcan_get(0);
        TEST_ASSERT_NOT_NULL(r);
        /* Session live → NACK with NVM_NOT_FOUND, never BAD_SESSION. */
        TEST_ASSERT_EQUAL_UINT8((uint8_t)BL_MSG_NACK, r->data[1]);
        TEST_ASSERT_EQUAL_UINT8((uint8_t)BL_NACK_NVM_NOT_FOUND, r->data[3]);
    }

    mock_fdcan_reset();
    send_cmd_sf((uint8_t)BL_CMD_DISCONNECT, NULL, 0U);
    TEST_ASSERT_EQUAL_INT(1, mock_fdcan_tx_count());
    {
        const mock_fdcan_frame_t *r = mock_fdcan_get(0);
        TEST_ASSERT_NOT_NULL(r);
        TEST_ASSERT_EQUAL_UINT8((uint8_t)BL_MSG_ACK, r->data[1]);
        TEST_ASSERT_EQUAL_UINT8((uint8_t)BL_CMD_DISCONNECT, r->data[2]);
    }

    /* Post-disconnect: same NVM_READ now NACKs BAD_SESSION. */
    mock_fdcan_reset();
    send_cmd_sf((uint8_t)BL_CMD_NVM_READ, probe_key, 2U);
    TEST_ASSERT_EQUAL_INT(1, mock_fdcan_tx_count());
    {
        const mock_fdcan_frame_t *r = mock_fdcan_get(0);
        TEST_ASSERT_NOT_NULL(r);
        TEST_ASSERT_EQUAL_UINT8((uint8_t)BL_MSG_NACK, r->data[1]);
        TEST_ASSERT_EQUAL_UINT8((uint8_t)BL_NACK_BAD_SESSION, r->data[3]);
    }
}

/* ---- DISCOVER ---- */

void test_handle_discover_uses_discover_reply_type_not_ack(void)
{
    /* DISCOVER is session-agnostic (no CONNECT first) and is the
     * only command that replies with msg_type = DISCOVER_REPLY
     * (0x05) instead of ACK (0x01). This pins both the routing AND
     * the payload shape: [opcode, node_id, ver_major, ver_minor]. */
    reset_session_and_tx();

    send_cmd_sf((uint8_t)BL_CMD_DISCOVER, NULL, 0U);

    TEST_ASSERT_EQUAL_INT(1, mock_fdcan_tx_count());
    const mock_fdcan_frame_t *tx = mock_fdcan_get(0);
    TEST_ASSERT_NOT_NULL(tx);
    /* PCI = SF with 5-byte payload: msg_type + opcode + node_id +
     * MAJOR + MINOR. (`send_message` prepends msg_type to the 4-byte
     * resp[] the handler builds.) */
    TEST_ASSERT_EQUAL_UINT8((uint8_t)(BL_ISOTP_PCI_SF | 0x05U), tx->data[0]);
    /* msg_type = DISCOVER_REPLY, NOT ACK. */
    TEST_ASSERT_EQUAL_UINT8((uint8_t)BL_MSG_DISCOVER_REPLY, tx->data[1]);
    /* Payload: opcode echo, node id, proto major, proto minor. */
    TEST_ASSERT_EQUAL_UINT8((uint8_t)BL_CMD_DISCOVER,        tx->data[2]);
    TEST_ASSERT_EQUAL_UINT8(0x01U,                            tx->data[3]); /* default BL_NODE_ID = 0x1 */
    TEST_ASSERT_EQUAL_UINT8((uint8_t)BL_PROTO_VERSION_MAJOR,  tx->data[4]);
    TEST_ASSERT_EQUAL_UINT8((uint8_t)BL_PROTO_VERSION_MINOR,  tx->data[5]);
}

/* ---- Session gating ---- */

/* Each session-gated opcode must NACK with BL_NACK_BAD_SESSION when
 * called from {session=false}. We assert one opcode per test so a
 * regression points at the specific handler whose gate dropped. */

static void assert_nack_bad_session_for_opcode(uint8_t opcode,
                                               const uint8_t *args,
                                               uint8_t args_len)
{
    reset_session_and_tx();
    send_cmd_sf(opcode, args, args_len);
    TEST_ASSERT_EQUAL_INT(1, mock_fdcan_tx_count());
    const mock_fdcan_frame_t *tx = mock_fdcan_get(0);
    TEST_ASSERT_NOT_NULL(tx);
    TEST_ASSERT_EQUAL_UINT8((uint8_t)BL_MSG_NACK, tx->data[1]);
    TEST_ASSERT_EQUAL_UINT8(opcode,                tx->data[2]);
    TEST_ASSERT_EQUAL_UINT8((uint8_t)BL_NACK_BAD_SESSION, tx->data[3]);
}

void test_session_gate_flash_erase_without_connect_nacks_bad_session(void)
{
    /* The session check runs BEFORE the args_len check in
     * handle_flash_erase, so a zero-arg payload is enough to
     * exercise the gate. Realistic 8-byte FLASH_ERASE args wouldn't
     * fit in an SF anyway (would need FF+CF). */
    assert_nack_bad_session_for_opcode((uint8_t)BL_CMD_FLASH_ERASE, NULL, 0U);
}

void test_session_gate_flash_write_without_connect_nacks_bad_session(void)
{
    /* Same shortcut as FLASH_ERASE: session check first, args
     * irrelevant for the gate. */
    assert_nack_bad_session_for_opcode((uint8_t)BL_CMD_FLASH_WRITE, NULL, 0U);
}

void test_session_gate_nvm_read_without_connect_nacks_bad_session(void)
{
    /* NVM_READ takes a 2-byte LE key. */
    uint8_t args[2] = { 0x01U, 0x00U };
    assert_nack_bad_session_for_opcode((uint8_t)BL_CMD_NVM_READ, args, 2U);
}

