isc-fs/stm32-can-bootloader/tests/unit/test_bl_proto_dispatch.c
void test_session_gate_log_stream_start_without_connect_nacks_bad_session(void)
{
    uint8_t args[1] = { 0x02U };  /* optional min-severity argument */
    assert_nack_bad_session_for_opcode((uint8_t)BL_CMD_LOG_STREAM_START, args, 1U);
}

/* ---- NVM round-trip via the dispatcher ---- */

void test_handle_nvm_read_returns_value_for_pre_written_key(void)
{
    /* Pre-program a known key/value via the real bl_nvm API (the
     * host test build links the real bl_nvm.c). Then CONNECT and
     * issue NVM_READ over the wire; assert the ACK carries the
     * exact stored value. This is the host-visible round-trip the
     * operator workflow (`cf config nvm read 0x0001`) depends on. */
    bl_nvm_init();
    const uint16_t key = 0x4567U;
    const uint8_t  expected[3] = { 0xDEU, 0xADU, 0xBEU };
    TEST_ASSERT_EQUAL_INT(BL_NVM_OK,
        bl_nvm_write(key, expected, sizeof(expected)));

    prime_session();

    /* NVM_READ args = key_le16 (2 bytes). */
    uint8_t args[2] = { (uint8_t)(key & 0xFFU), (uint8_t)((key >> 8) & 0xFFU) };
    send_cmd_sf((uint8_t)BL_CMD_NVM_READ, args, 2U);

    /* Reply payload: [opcode, len, value...]. With len=3 the
     * handler builds a 5-byte resp[] and `send_ack` prepends the
     * msg_type byte → 6 wire bytes total: msg_type + opcode + len
     * + 3 value bytes. The whole thing fits in one SF (≤7). */
    TEST_ASSERT_EQUAL_INT(1, mock_fdcan_tx_count());
    const mock_fdcan_frame_t *tx = mock_fdcan_get(0);
    TEST_ASSERT_NOT_NULL(tx);
    TEST_ASSERT_EQUAL_UINT8((uint8_t)(BL_ISOTP_PCI_SF | 0x06U), tx->data[0]);
    TEST_ASSERT_EQUAL_UINT8((uint8_t)BL_MSG_ACK,           tx->data[1]);
    TEST_ASSERT_EQUAL_UINT8((uint8_t)BL_CMD_NVM_READ,      tx->data[2]);
    TEST_ASSERT_EQUAL_UINT8(0x03U,                          tx->data[3]); /* len */
    TEST_ASSERT_EQUAL_UINT8(expected[0],                    tx->data[4]);
    TEST_ASSERT_EQUAL_UINT8(expected[1],                    tx->data[5]);
    TEST_ASSERT_EQUAL_UINT8(expected[2],                    tx->data[6]);
}

void test_handle_nvm_read_unknown_key_nacks_not_found(void)
{
    /* setUp() already wiped flash; NVM is empty. A read against any
     * key must therefore NACK with NVM_NOT_FOUND. */
    bl_nvm_init();
    prime_session();

    uint8_t args[2] = { 0xCDU, 0xABU };  /* arbitrary unused key */
    send_cmd_sf((uint8_t)BL_CMD_NVM_READ, args, 2U);

    TEST_ASSERT_EQUAL_INT(1, mock_fdcan_tx_count());
    const mock_fdcan_frame_t *tx = mock_fdcan_get(0);
    TEST_ASSERT_NOT_NULL(tx);
    TEST_ASSERT_EQUAL_UINT8((uint8_t)BL_MSG_NACK,           tx->data[1]);
    TEST_ASSERT_EQUAL_UINT8((uint8_t)BL_CMD_NVM_READ,       tx->data[2]);
    TEST_ASSERT_EQUAL_UINT8((uint8_t)BL_NACK_NVM_NOT_FOUND, tx->data[3]);
}

void test_handle_nvm_write_persists_value_visible_to_nvm_read_api(void)
{
    /* Send NVM_WRITE for a known key over the wire, then read it
     * back through the direct bl_nvm_read API to confirm the value
     * actually landed in flash. This is the symmetric half of the
     * read round-trip — together they cover the host's full
     * provisioning loop (write key, reboot, confirm via read). */
    bl_nvm_init();
    prime_session();

    /* Args: key_le16 + value bytes. Use key 0x5000 (user-range, not
     * a reserved BL key) so the test can't accidentally trip the
     * node-id resolver in another test. */
    uint8_t args[4] = { 0x00U, 0x50U, 0x11U, 0x22U };
    send_cmd_sf((uint8_t)BL_CMD_NVM_WRITE, args, 4U);

    /* ACK arrived. */
    TEST_ASSERT_EQUAL_INT(1, mock_fdcan_tx_count());
    const mock_fdcan_frame_t *tx = mock_fdcan_get(0);
    TEST_ASSERT_NOT_NULL(tx);
    TEST_ASSERT_EQUAL_UINT8((uint8_t)BL_MSG_ACK,        tx->data[1]);
    TEST_ASSERT_EQUAL_UINT8((uint8_t)BL_CMD_NVM_WRITE,  tx->data[2]);

    /* Value persisted at the right key — read it back directly. */
    uint8_t value[BL_NVM_MAX_VALUE_LEN] = { 0 };
    uint8_t value_len = 0U;
    bl_nvm_status_t st = bl_nvm_read(0x5000U, value, sizeof(value), &value_len);
    TEST_ASSERT_EQUAL_INT(BL_NVM_OK, st);
    TEST_ASSERT_EQUAL_UINT8(2U, value_len);
    TEST_ASSERT_EQUAL_UINT8(0x11U, value[0]);
    TEST_ASSERT_EQUAL_UINT8(0x22U, value[1]);
}

/* ---- Unknown opcodes ---- */

void test_dispatch_unknown_opcode_nacks_unsupported(void)
{
    /* The catch-all in the dispatch table must NACK rather than
     * silently drop — the same #60 principle as the bad-PCI gate.
     * Pick an opcode that's not in the table (0x99 is in the
     * reserved gap between 0x82 NVM_FORMAT and the next future
     * range). */
    reset_session_and_tx();

    send_cmd_sf(0x99U, NULL, 0U);

    TEST_ASSERT_EQUAL_INT(1, mock_fdcan_tx_count());
    const mock_fdcan_frame_t *tx = mock_fdcan_get(0);
    TEST_ASSERT_NOT_NULL(tx);
    TEST_ASSERT_EQUAL_UINT8((uint8_t)BL_MSG_NACK,       tx->data[1]);
    TEST_ASSERT_EQUAL_UINT8(0x99U,                       tx->data[2]);
    TEST_ASSERT_EQUAL_UINT8((uint8_t)BL_NACK_UNSUPPORTED, tx->data[3]);
}

/* ---- #123 (general fix): NOTIFY suppression during reassembly ---- */

void test_send_notify_suppressed_while_reassembly_in_flight(void)
{
    /* Regression guard for audit finding H1 / issue #123. While an
     * inbound multi-frame transfer is mid-flight (g_rx in WAIT_CF), an
     * unsolicited NOTIFY (heartbeat / live-data / log / DTC — all route
     * through bl_proto_send_notify) must NOT be emitted: dropping a
     * multi-frame NOTIFY onto the bus mid-WRITE_CHUNK strands the
     * host's transfer (BlockSize=0 → no pacing) → 1 s timeout → NACK
     * 0x09. This is exactly the failure the bench saw. */
    reset_session_and_tx();

    /* Feed a First Frame so the reassembler enters WAIT_CF. total=134
     * (0x86) means it now expects CFs. The FF itself triggers one
     * FC(CTS) reply — clear it so the assertion sees only what the
     * NOTIFY does (or doesn't) emit. */
    bl_proto_id_t id = host_to_us();
    uint8_t ff[8] = { 0x10U, 0x86U, (uint8_t)BL_MSG_CMD,
                      (uint8_t)BL_CMD_FLASH_WRITE, 0x00U, 0x00U, 0x02U, 0x08U };
    bl_proto_dispatch(&id, ff, 8U);
    TEST_ASSERT_EQUAL_UINT16(6U, bl_proto_isotp_rx_progress()); /* WAIT_CF, 6 bytes in */
    mock_fdcan_reset();

    /* A heartbeat-shaped NOTIFY while mid-reassembly → suppressed. */
    uint8_t notify[7] = { 0xF0U, 0x01U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U };
    bl_proto_send_notify(notify, (uint16_t)sizeof(notify));
    TEST_ASSERT_EQUAL_INT(0, mock_fdcan_tx_count());
}

void test_send_notify_emitted_when_idle(void)
{
    /* Control: with no reassembly in flight, the same NOTIFY DOES go
     * out — confirms the gate only suppresses during WAIT_CF and
     * doesn't silence heartbeats on an idle link.
     *
     * Note the 7-byte heartbeat payload becomes an 8-byte message
     * (send_message prepends msg_type) which exceeds the 7-byte SF
     * limit → it ships as FF + CF (2 frames). That multi-frame shape
     * is precisely why an unsolicited heartbeat mid-transfer was so
     * destructive in #123 — so the control asserts "emitted at all"
     * rather than a specific frame count, keeping it robust to
     * ISO-TP framing details covered by other tests. */
    reset_session_and_tx();
    TEST_ASSERT_EQUAL_UINT16(0U, bl_proto_isotp_rx_progress());

    uint8_t notify[7] = { 0xF0U, 0x01U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U };
    bl_proto_send_notify(notify, (uint16_t)sizeof(notify));

    TEST_ASSERT_GREATER_OR_EQUAL_INT(1, mock_fdcan_tx_count());
    /* First frame is the ISO-TP FF: data[0]=FF PCI, data[1]=len low
     * byte, data[2]=msg_type. Confirm it's a NOTIFY. */
    const mock_fdcan_frame_t *tx = mock_fdcan_get(0);
    TEST_ASSERT_NOT_NULL(tx);
    TEST_ASSERT_EQUAL_UINT8((uint8_t)BL_ISOTP_PCI_FF, (uint8_t)(tx->data[0] & 0xF0U));
    TEST_ASSERT_EQUAL_UINT8((uint8_t)BL_MSG_NOTIFY,   tx->data[2]);
}
